DataProcessors/ВыгрузкаТоваровФруктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаТоваровФруктов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Характеристики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Характеристики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВыгрузкаТоваровФруктов/Forms/ФормаОбработки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьРезультатВыгрузкиНаСервере(ИнициализироватьТаблицуРезультата());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьТовары(Команда)

	Попытка
		ВыполнитьВыгрузкуНаСервере();
		ОткрытьФормуСпискаНоменклатуры();
		ПоказатьСообщениеПользователю(НСтр("ru = 'Создано 10 товаров и 10 характеристик.'"));
	Исключение
		ПоказатьСообщениеПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьВыгрузкуНаСервере()

	ТаблицаРезультата = ВыполнитьВыгрузкуНаСервереБезКонтекста();
	УстановитьРезультатВыгрузкиНаСервере(ТаблицаРезультата);

КонецПроцедуры

&НаСервере
Процедура УстановитьРезультатВыгрузкиНаСервере(ТаблицаРезультата)

	ЗначениеВРеквизитФормы(ТаблицаРезультата, "РезультатВыгрузки");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаНоменклатуры()

	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСообщениеПользователю(ТекстСообщения)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьВыгрузкуНаСервереБезКонтекста()

	ТаблицаРезультата = ИнициализироватьТаблицуРезультата();

	НачатьТранзакцию();
	Попытка
		УдалитьРанееСозданныеТовары();
		СоздатьТоварыИХарактеристики(ТаблицаРезультата);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение НСтр("ru = 'Не удалось создать тестовые товары.'")
			+ Символы.ПС
			+ ОписаниеОшибки();
	КонецПопытки;

	Возврат ТаблицаРезультата;

КонецФункции

&НаСервереБезКонтекста
Функция ИнициализироватьТаблицуРезультата()

	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРезультата.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(30)));
	ТаблицаРезультата.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.Характеристики"));
	ТаблицаРезультата.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ТаблицаРезультата.Колонки.Добавить("Размер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));

	Возврат ТаблицаРезультата;

КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьРанееСозданныеТовары()

	МассивНоменклатуры = ПолучитьРанееСозданныеТовары();
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СсылкаНоменклатуры Из МассивНоменклатуры Цикл
		УдалитьХарактеристикиНоменклатуры(СсылкаНоменклатуры);
		ОбъектНоменклатуры = СсылкаНоменклатуры.ПолучитьОбъект();
		ОбъектНоменклатуры.Удалить();
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРанееСозданныеТовары()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|   Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|   Номенклатура.Артикул ПОДОБНО &ШаблонАртикула";
	Запрос.УстановитьПараметр("ШаблонАртикула", ПолучитьШаблонАртикула());

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();

	МассивНоменклатуры = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Ссылка);
	КонецЦикла;

	Возврат МассивНоменклатуры;

КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьХарактеристикиНоменклатуры(СсылкаНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   Характеристики.Ссылка КАК Ссылка
	|ИЗ
	|   Справочник.Характеристики КАК Характеристики
	|ГДЕ
	|   Характеристики.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", СсылкаНоменклатуры);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОбъектХарактеристики = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектХарактеристики.Удалить();
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьТоварыИХарактеристики(ТаблицаРезультата)

	МассивФруктов = ПолучитьМассивФруктов();
	НомерФрукта = 0;

	Для Каждого ДанныеФрукта Из МассивФруктов Цикл
		НомерФрукта = НомерФрукта + 1;

		Артикул = СформироватьАртикул(НомерФрукта);
		СсылкаНоменклатуры = СоздатьЭлементНоменклатуры(ДанныеФрукта.Наименование, Артикул);
		СсылкаХарактеристики = СоздатьХарактеристику(
			СсылкаНоменклатуры,
			ДанныеФрукта.Цвет,
			ДанныеФрукта.Размер);

		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Номенклатура = СсылкаНоменклатуры;
		НоваяСтрока.Артикул = Артикул;
		НоваяСтрока.Характеристика = СсылкаХарактеристики;
		НоваяСтрока.Цвет = ДанныеФрукта.Цвет;
		НоваяСтрока.Размер = ДанныеФрукта.Размер;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьЭлементНоменклатуры(Наименование, Артикул)

	ЭлементНоменклатуры = Справочники.Номенклатура.СоздатьЭлемент();
	ЭлементНоменклатуры.Наименование = Наименование;
	ЭлементНоменклатуры.Артикул = Артикул;
	ЭлементНоменклатуры.Записать();

	Возврат ЭлементНоменклатуры.Ссылка;

КонецФункции

&НаСервереБезКонтекста
Функция СоздатьХарактеристику(СсылкаНоменклатуры, Цвет, Размер)

	ЭлементХарактеристики = Справочники.Характеристики.СоздатьЭлемент();
	ЭлементХарактеристики.Владелец = СсылкаНоменклатуры;
	ЭлементХарактеристики.Цвет = Цвет;
	ЭлементХарактеристики.Размер = Размер;
	ЭлементХарактеристики.Записать();

	Возврат ЭлементХарактеристики.Ссылка;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивФруктов()

	МассивФруктов = Новый Массив;

	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Яблоко", "Красный", "Средний"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Банан", "Желтый", "Большой"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Апельсин", "Оранжевый", "Средний"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Груша", "Зеленый", "Средний"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Лимон", "Желтый", "Маленький"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Киви", "Коричневый", "Маленький"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Виноград", "Фиолетовый", "Маленький"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Манго", "Оранжево-зеленый", "Большой"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Персик", "Розово-оранжевый", "Средний"));
	МассивФруктов.Добавить(Новый Структура("Наименование, Цвет, Размер", "Слива", "Темно-фиолетовый", "Маленький"));

	Возврат МассивФруктов;

КонецФункции

&НаСервереБезКонтекста
Функция СформироватьАртикул(НомерФрукта)

	Возврат ПолучитьПрефиксАртикула() + Прав("0" + Строка(НомерФрукта), 2);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонАртикула()

	Возврат ПолучитьПрефиксАртикула() + "%";

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПрефиксАртикула()

	Возврат "EPF-FRUIT-";

КонецФункции

#КонецОбласти
